# Shell
brew "starship"
brew "sheldon"
brew "fzf"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"

# Modern CLI replacements
brew "bat"        # better cat
brew "eza"        # better ls
brew "fd"         # better find
brew "delta"      # better git diff
brew "zoxide"     # smarter cd

# Utilities
brew "jq"         # JSON processor
brew "tree"       # directory tree
brew "btop"       # resource monitor

# Font
cask "font-jetbrains-mono-nerd-font"

# Development
brew "fnm"
brew "pnpm"
brew "uv"

# Git / GitHub
brew "gh"

# Google Workspace
brew "steipete/tap/gogcli"

# AI
brew "steipete/tap/summarize"
