# Taps
tap "hashicorp/tap"

# Shell
brew "starship"
brew "sheldon"
brew "fzf"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"

# Modern CLI replacements
brew "bat"        # better cat
brew "eza"        # better ls
brew "fd"         # better find
brew "delta"      # better git diff
brew "zoxide"     # smarter cd

# Terminal multiplexer
brew "tmux"       # used with iTerm2 Control Mode for remote SSH

# Utilities
brew "jq"         # JSON processor
brew "sqlite"     # SQL database
brew "tree"       # directory tree
brew "btop"       # resource monitor
brew "duti"       # default app associations

# Font
cask "font-jetbrains-mono-nerd-font"

# Development
brew "fnm"
brew "pnpm"
brew "uv"
brew "ruff"
brew "hashicorp/tap/terraform"
brew "awscli"
cask "gcloud-cli"
cask "visual-studio-code"

# Git / GitHub
brew "gh"

# Google Workspace
brew "steipete/tap/gogcli"
